Repository: AIProjects8/multiagent-telegram
Catalog: Agents/TimeAgent/locale/*/LC_MESSAGES/messages.po
Languages: pl

source: Configuration error: {error}
pl: Błąd konfiguracji: {error}

source: Error getting city information: {error}
pl: Błąd podczas pobierania informacji o mieście: {error}

source: I'm sorry, I don't understand your request. Please try again.
pl: Przepraszam, nie rozumiem Twojego żądania. Spróbuj ponownie.

source: The sunrise in {city} will be tomorrow at {time}.
pl: Wschód słońca w {city} będzie jutro o {time}.

source: The sunrise in {city} will be at {time}.
pl: Wschód słońca w {city} będzie o {time}.

source: Error: {error}
pl: Błąd: {error}

source: Error getting sunrise information: {error}
pl: Błąd podczas pobierania informacji o wschodzie słońca: {error}

source: The sunset in {city} will be tomorrow at {time}.
pl: Zachód słońca w {city} będzie jutro o {time}.

source: The sunset in {city} will be at {time}.
pl: Zachód słońca w {city} będzie o {time}.

source: Error getting sunset information: {error}
pl: Błąd podczas pobierania informacji o zachodzie słońca: {error}

source: An error occurred while determining the query type.
pl: Wystąpił błąd podczas określania typu zapytania.

source: The time in {city} is {time}
pl: Czas w miejscowości {city} to {time}
