Repository: AIProjects8/multiagent-telegram
Catalog: Agents/WeatherAgent/locale/*/LC_MESSAGES/messages.po
Languages: pl

source: I can't provide a weather forecast without knowing the city name. Please provide the city name or configure the default city in the settings.
pl: Nie mogę udzielić prognozy pogody bez znajomości nazwy miasta. Podaj nazwę miasta lub skonfiguruj domyślne miasto w ustawieniach.

source: Configuration error: {error}
pl: Błąd konfiguracji: {error}

source: Sorry, an error occurred while fetching the weather forecast: {error}
pl: Przepraszam, wystąpił błąd podczas pobierania prognozy pogody: {error}

source: Weather forecast for {city} on {day} {date}.
pl: Prognoza pogody dla miejscowości {city} na {day} {date}.

source: Temperature will range from {min_temp} to {max_temp} degrees Celsius.
pl: Temperatura będzie wahać się od {min_temp} do {max_temp} °C.

source: Rain is expected {times}.
pl: Deszcz jest oczekiwany {times}.

source: Snow may fall {times}.
pl: Śnieg może padać {times}.

source: Fog may occur {times}.
pl: Mgła może wystąpić {times}.

source: Strong wind is expected {times}.
pl: Silny wiatr jest oczekiwany {times}.

source: Heavy cloud cover {times}.
pl: Duże zachmurzenie {times}.

source: Clear sky {times}.
pl: Bezchmurne niebo {times}.

source: No precipitation is expected.
pl: Nie oczekuje się opadów.

source: at {hour}
pl: o {hour}

source: from {start_hour} to {end_hour}
pl: od {start_hour} do {end_hour}

source: and
pl: i

source: No weather data available.
pl: Brak dostępnych danych pogodowych.
